# Colors Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseExportOptions..::..Colors Property
BaseExportOptions Class See Also
---
Export color mode. Default value is ExportColorMode.IndexColors.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ExportColorMode Colors { get; set; }
```

Visual Basic
---
```text
Public Property Colors As ExportColorMode
	Get
	Set
```

Visual C++
---
```text
public:
property ExportColorMode Colors {
	ExportColorMode get ();
	void set (ExportColorMode value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace